<div class="tab-pane active" id="kt_tab_pane_1" role="tabpanel">

    <div class="row">
        <?php
        $arr_q = [
            'choosingStyle4_1'=> [
                1=>[[43,15],[65,-9]], //свитер
                2=>[[-40,10],[0,-9]], //футболка
                3=>[[-13,28],[34,15]], //джинсы
                4=>[[43,68],[70,54]], //сумка
            ],

            'choosingStyle4' => [
                1 => [[6, 60], [0, 0]], //Нравится колье
                2 => [[-30, 10], [0, 0]], //нравится топ
                3 => [[26, 28], [0, 0]], //нравится пиджак
                4 => [[33, 78], [0, 0]], //нравятся туфли
                5 => [[-30, 50], [0, 0]], //нравится джинсы
            ],

            'choosingStyle5_1'=> [
                    1=>[[43,15],[65,-9]], //Нравится рубашка
                    2=>[[-43,10],[0,-9]], //Нравится топ
                    3=>[[40,68],[70,50]], //нравится сумка
                    4=>[[-13,32],[34,15]] //Нравятся брюки
            ],

            'choosingStyle5' => [
                1 => [[0, 20], [0, 0]], //Нравятся штаны
                2 => [[-33, 15], [0, 0]], //Нравится туника
                3 => [[33, 25], [0, 0]], //нравится кофта
                4 => [[40, 68], [0, 0]], //Нравится сумка
                5 => [[-30, 65], [0, 0]], //нравятся туфли
            ],

            'choosingStyle6_1'=>
                [
                    1=>[[-43,30],[0,15]], //Нравится свитер
                    2=>[[15,40],[34,2]], //Нравятся джинсы
                    3=>[[43,28],[65,11]] //Нравится сумка
                ],

            'choosingStyle6' =>
                [
                    1 => [[-20, 50], [0, 0]], //Нравится пальто
                    2 => [[-38, 15], [0, 0]], //Нравится футболка
                    3 => [[38, 30], [0, 0]], //нравится юбка
                    4 => [[40, 68], [0, 0]], //Нравятся ботинки
                    5 => [[-40, 60], [0, 0]], //нравятся серьги
                ],

            'choosingStyle7_1'=>
                [
                    1=>[[-43,30],[0,5]], //Нравится джинсовая рубашка
                    2=>[[-5,20],[30,80]], //Нравится платье
                    3=>[[43,17],[65,35]] //Нравится сумка
                ],

            'choosingStyle7' =>
                [
                    1 => [[0, 20], [0, 0]], //Нравятся штаны
                    2 => [[-38, 25], [0, 0]], //Нравится колье
                    3 => [[33, 25], [0, 0]], //нравится пиджак
                    4 => [[35, 68], [0, 0]], //Нравится сумка
                    5 => [[-38, 65], [0, 0]], //нравятся туфли
                ],

            'choosingStyle8_1'=>
                [
                    1=>[[-43,30],[0,15]], //Нравится кардиган
                    2=>[[-5,30],[40,7]], //Нравится юбка
                    3=>[[43,21],[70,40]], //Нравится сумка
                ],

            'choosingStyle8' =>
                [
                    1 => [[28, 55], [0, 0]], //Нравятся брюки
                    2 => [[-28, 25], [0, 0]], //Нравится пиджак
                    3 => [[23, 15], [0, 0]], //нравится топ
                    4 => [[30, 78], [0, 0]], //Нравится туфли
                    5 => [[-28, 55], [0, 0]], //нравится колье
                    6 => [[-28, 75], [0, 0]], //нравится сумка
                ],

            'choosingStyle9'=>
                [
                    1=>[[43,5],[65,-7]], //Нравится пиджак
                    2=>[[-38,5],[2,-10]], //Нравится топ
                    3=>[[43,65],[62,55]], //Нравится сумка
                    4=>[[-13,32],[30,5]] //Нравятся брюки
                ],

            'choosingStyle10'=>
                [
                    1=>[[-43,30],[0,10]], //Нравится рубашка
                    2=>[[-10,30],[35,0]], //Нравятся брюки
                    3=>[[43,21],[70,45]], //Нравится сумка
                ],

            'choosingStyle11'=>
                [
                    1=>[[43,15],[65,-9]], //Нравится пиджак
                    2=>[[-40,5],[5,-9]], //Нравится топ
                    3=>[[-13,32],[34,10]], //Нравятся брюки
                    4=>[[35,65],[60,50]] //Нравится сумка
                ],

            'choosingStyle12'=>
                [
                    1=>[[-43,30],[0,10]], //Нравится рубашка
                    2=>[[-10,30],[40,0]], //Нравится юбка
                    3=>[[45,19],[70,45]], //Нравится сумка
                ],

            'choosingStyle13'=>
                [
                    1=>[[-43,30],[0,15]], //Нравится худи
                    2=>[[-12,30],[35,5]], //Нравится юбка
                    3=>[[38,19],[65,50]], //Нравится рюкзак
                ],

            'choosingStyle16_1' =>
                [
                    1=>[[-43,30],[0,15]], //Нравится блуза
                    2=>[[-10,30],[35,8]], //Нравятся джинсы
                    3=>[[40,24],[70,50]], //Нравится сумка
                ],

            'choosingStyle16' =>
                [
                    1 => [[-28, 75], [0, 0]], //нравится сумка
                    2 => [[-30, 25], [0, 0]], //Нравится рубашка
                    3 => [[23, 15], [0, 0]], //нравятся штаны
                    4 => [[30, 78], [0, 0]], //нравится куртка
                    5 => [[-28, 55], [0, 0]], //Нравятся ботинки
                    6 => [[-8, 55], [0, 0]], //нравится кепка
                ],

            'choosingStyle17_1' =>
                [
                    1=>[[17,30],[35,4]], //Нравится платье
                    2=>[[-43,40],[0,25]], //Нравится сумка
                ],

            'choosingStyle17' =>
                [
                    1 => [[0, 20], [0, 0]], //платье
                    2 => [[-28, 25], [0, 0]], //очки
                    3 => [[33, 25], [null, null]], //серьги
                    4 => [[30, 58], [0, 0]], //туфли
                    5 => [[-38, 55], [0, 0]], //сумка
                ],

            'choosingStyle18_1'=>
                [
                    1=>[[-43,30],[0,10]], //Нравится джинсовая куртка
                    2=>[[20,30],[35,5]], //нравится платье
                ],

            'choosingStyle18' =>
                [
                    1 => [[-35, 25], [0, 0]], //пиджак
                    2 => [[0, 15], [0, 0]], //колье
                    3 => [[33, 55], [0, 0]], //платье
                    4 => [[-8, 55], [0, 0]], //серьги
                    5 => [[10, 68], [0, 0]], //сумка
                    6 => [[-38, 65], [0, 0]], //туфли
                ],

            'choosingStyle19_1'=>
                [
                    1=>[[-43,30],[0,10]], //Нравится водолазка
                    2=>[[-10,30],[35,0]], //Нравится юбка
                    3=>[[43,21],[70,40]], //Нравится сумка
                ],

            'choosingStyle19' =>
                [
                    1 => [[0, 20], [0, 0]], //юбка
                    2 => [[-38, 25], [0, 0]], //колье
                    3 => [[33, 25], [null, null]], //кофта
                    4 => [[30, 58], [0, 0]], //сумка
                    5 => [[-38, 65], [0, 0]], //туфли
                ],

            'choosingStyle20_1'=>
                [
                    1=>[[-43,30],[0,10]], //Нравится пиджак
                    2=>[[-5,40],[37,0]], //Нравится платье
                    3=>[[40,19],[65,45]], //Нравится сумка
                ],

            'choosingStyle20' =>
                [
                    1 => [[0, 25], [0, 0]], //джины
                    2 => [[-38, 25], [0, 0]], //колье
                    3 => [[33, 25], [null, null]], //кофта
                    4 => [[30, 58], [0, 0]], //сумка
                    5 => [[-38, 65], [0, 0]], //туфли
                ],

            'choosingStyle25' =>
                [
                    1 => [[-38, 15], [65, -9]], //Нравится пиджак
                    2 => [[0, 13], [5, -9]], //Нравится рубашка
                    3 => [[40, 17], [32, 10]], //Нравится юбка
                    4 => [[47, 65], [65, 55]], //Нравится сумка
                    5 => [[0, 80], [45, 34]], //Нравится сумка
                    6 => [[-40, 63], [56, 55]] //Нравится сумка
                ],

            'choosingStyle26' =>
                [
                    1 => [[-27, 17], [65, -9]], //Нравится пиджак
                    2 => [[2, 13], [5, -9]], //Нравится рубашка
                    3 => [[35, 20], [32, 10]], //Нравится юбка
                    4 => [[42, 50], [65, 55]], //Нравится сумка
                    5 => [[3, 75], [45, 34]], //Нравится сумка
                    6 => [[-45, 60], [56, 55]] //Нравится сумка
                ],

            'choosingStyle27' =>
                [
                    1 => [[-38, 15], [65, -9]], //Нравится пиджак
                    2 => [[-2, 12], [5, -9]], //Нравится рубашка
                    3 => [[40, 17], [32, 10]], //Нравится юбка
                    4 => [[41, 65], [65, 55]], //Нравится сумка
                    5 => [[-2, 81], [45, 34]], //Нравится сумка
                    6 => [[-40, 63], [56, 55]] //Нравится сумка
                ],

            'choosingStyle28' =>
                [
                    1 => [[-37, 20], [65, -9]], //Нравится пиджак
                    2 => [[-1, 28], [5, -9]], //Нравится рубашка
                    3 => [[39, 25], [32, 10]], //Нравится юбка
                    4 => [[38, 61], [65, 55]], //Нравится сумка
                    5 => [[-43, 61], [65, 55]] //Нравится сумка
                ],

            'choosingStyle29' =>
                [
                    1 => [[-35, 15], [65, -9]], //Нравится пиджак
                    2 => [[-1, 25], [5, -9]], //Нравится рубашка
                    3 => [[39, 18], [32, 10]], //Нравится юбка
                    4 => [[46, 68], [65, 55]], //Нравится сумка
                    5 => [[-43, 68], [65, 55]] //Нравится сумка
                ],

            'choosingStyle30' =>
                [
                    1 => [[-40, 15], [65, -9]], //Нравится пиджак
                    2 => [[1, 25], [5, -9]], //Нравится рубашка
                    3 => [[41, 17], [32, 10]], //Нравится юбка
                    4 => [[38, 65], [65, 55]], //Нравится сумка
                    5 => [[-43, 65], [65, 55]] //Нравится сумка
                ],

            'choosingStyle31' =>
                [
                    1 => [[-40, 15], [65, -9]], //Нравится пиджак
                    2 => [[1, 25], [5, -9]], //Нравится рубашка
                    3 => [[41, 17], [32, 10]], //Нравится юбка
                    4 => [[38, 65], [65, 55]], //Нравится сумка
                    5 => [[-43, 65], [65, 55]] //Нравится сумка
                ],

            'choosingStyle32' =>
                [
                    1 => [[-38, 15], [65, -9]], //Нравится пиджак
                    2 => [[0, 13], [5, -9]], //Нравится рубашка
                    3 => [[40, 17], [32, 10]], //Нравится юбка
                    4 => [[41, 65], [65, 55]], //Нравится сумка
                    5 => [[0, 85], [45, 34]], //Нравится сумка
                    6 => [[-40, 63], [56, 55]] //Нравится сумка
                ],

            'choosingStyle33' =>
                [
                    1 => [[-40, 15], [65, -9]], //Нравится пиджак
                    2 => [[0, 17], [5, -9]], //Нравится рубашка
                    3 => [[41, 17], [32, 10]], //Нравится юбка
                    4 => [[38, 65], [65, 55]], //Нравится сумка
                    5 => [[-43, 65], [65, 55]] //Нравится сумка
                ],
            'choosingStyle34' =>
                [
                    1 => [[-40, 15], [65, -9]], //Нравится пиджак
                    2 => [[-3, 25], [5, -9]], //Нравится рубашка
                    3 => [[41, 17], [32, 10]], //Нравится юбка
                    4 => [[50, 65], [65, 55]], //Нравится сумка
                    5 => [[-43, 65], [65, 55]] //Нравится сумка
                ],


            /*'question_21.png'=>
                [
                    1=>[[-43,30],[0,15]], //Нравится свитер
                    2=>[[-7,30],[35,5]], //Нравятся брюки
                    3=>[[38,19],[65,50]], //Нравится сумка
                ],*/

            /*'question_22.png'=>
                [
                    1=>[[43,15],[65,-9]], //Нравится рубашка
                    2=>[[-45,10],[5,-9]], //Нравится футболка
                    3=>[[-18,42],[30,10]], //Нравятся джинсы
                    4=>[[35,65],[65,50]] //Нравится клатч
                ],

            'question_23.png'=>
                    [
                        1=>[[43,15],[65,-9]], //Нравится кардиган
                        2=>[[-45,10],[5,-9]], //Нравится водолазка
                        3=>[[-14,42],[32,10]], //Нравятся брюки
                        4=>[[38,65],[65,55]] //Нравится сумка
                    ],

            'question_24.png'=>
                    [
                        1=>[[43,15],[65,-9]], //Нравится пиджак
                        2=>[[-45,10],[5,-9]], //Нравится рубашка
                        3=>[[-14,42],[32,10]], //Нравится юбка
                        4=>[[38,65],[65,55]] //Нравится сумка
                    ]*/

        ]; ?>

        @foreach([
    'choosingStyle4',
    'choosingStyle4_1',
    'choosingStyle5',
    'choosingStyle5_1',
    'choosingStyle6',
    'choosingStyle6_1',
    'choosingStyle7',
    'choosingStyle7_1',
    'choosingStyle8',
    'choosingStyle8_1',
    'choosingStyle9',
    'choosingStyle10',
    'choosingStyle11',
    'choosingStyle12',
    'choosingStyle13',
    'choosingStyle16',
    'choosingStyle16_1',
    'choosingStyle17',
    'choosingStyle17_1',
    'choosingStyle18',
    'choosingStyle18_1',
    'choosingStyle19',
    'choosingStyle19_1',
    'choosingStyle20',
    'choosingStyle20_1',
    'choosingStyle25',
    'choosingStyle26',
    'choosingStyle27',
    'choosingStyle28',
    'choosingStyle29',
    'choosingStyle30',
    'choosingStyle31',
    'choosingStyle32',
    'choosingStyle33',
    'choosingStyle34'] as $q_number)
            <?php
            if (empty($anketa[$q_number])) continue;
            if (!isset($anketa[$q_number]['answer'])) continue;?>
            @if(count($anketa[$q_number]['answer']) > 0)
                <div class="col-lg-4 col-md-6 col-sm-8 pb-6 mt-3">

                    <div style="position:relative;" class="m-3 p-3">

                        <?php
                        $arr_coord = $arr_q[$q_number];
                        ?>
                        @foreach($arr_coord as $key => $value)
                            @if($anketa[$q_number]['answer'] == [0] ||  in_array($key, $anketa[$q_number]['answer']))
                                @include('admin.anketa.show.lable-img', ['left'=> $value[0][0], 'top'=> $value[0][1]])
                                {{--@include('admin.anketa.show.lable-text', ['left'=>$value[1][0], 'top'=>$value[1][1], 'text' => $anketa[$q_number]['option'][$key]['text'] ?? ''])--}}
                            @endif
                        @endforeach

                        @if($anketa[$q_number]['answer'])

                            <img class="card-img img-fluid mb-1" src="{{ $anketa[$q_number]['image'] }}">
                            @if(count($anketa[$q_number]['answer']) == 1)
                                @isset($anketa[$q_number]['text'])
                                    <div style="text-align: center">{{ $anketa[$q_number]['text'] }}</div>
                                @endisset
                            @endif
                        @endif

                    </div>
                </div>
            @endif
        @endforeach
    </div><!--row-->
</div><!--tab-pane-->
